#+title: Nix-based Multi-Project Dependency Management
#+setupfile: doc/links.org

[[https://github.com/shajra/nix-project-multi/actions][https://github.com/shajra/nix-project-multi/workflows/CI/badge.svg]]

** Installing scripts

Once configured, you can use =dependencies-pull= and =dependencies-push=
directly from this repository.

Both of these scripts delegate to a single script =nix-project-multi=, which you
can install with =nix-env= if you like. You can look at =dependencies-pull= and
=dependencies-push= to see that all they do is call =nix-project-multi= with
either a =pull= or =push= argument respectively.

Here's how to install =nix-project-multi=:

#+name: nix-env-install
#+begin_src sh :session env :results output :exports both :post crop(text=*this*, first-n=1, last-n=3)
nix-env --install --file . --attr nix-project-multi 2>&1
#+end_src

#+RESULTS: nix-env-install
: installing 'nix-project-multi'

If you have =~/.nix-profile/bin= on your =PATH=, you should be able to call
=nix-project-multi=.

** Detailed usage

We can look at the script usage from the =--help= option for more details:

#+name: help
#+begin_src sh :session env :results output :exports both
nix-project-multi --help
#+end_src

#+RESULTS: help
#+begin_example
USAGE: nix-project-multi MODE [OPTION]... [PROJECT_SOURCES_JSON]...

DESCRIPTION:

    Manage dependencies for many projects from a centralized
    project.  The dependencies must be in the JSON format of
    the Niv tool.

MODES

    pull   pull dependencies into centralized project
    push   push dependencies out to managed projects

OPTIONS:

    --help             print this help message
    -C --config  PATH  path to configuration file to use
    -c --central PATH  centralized sources JSON
    -n --dry-run       print files affects, but don't run
#+end_example

